:orange_circle:
```
sudo docker compose run --rm devops-utils sh -c 'aws sts get-caller-identity'
{
    "UserId": "AROA2QIXXJAZFIC6A6JJH:arthur.nguyen@mantelgroup.com.au",
    "Account": "722141136946",
    "Arn": "arn:aws:sts::722141136946:assumed-role/AWSReservedSSO_AdministratorAccess_97de9e78ac747093/arthur.nguyen@mantelgroup.com.au"
}
sudo docker compose run --rm devops-utils sh -c 'cd components/ansible; terraform init -backend-config="bucket=devops-blog-arthur-200" -backend-config="key="workloads/ansible/instance-terraform.tfstate"" -backend-config="region=ap-southeast-2"'
[0m[1mInitializing modules...[0m

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- terraform.io/builtin/terraform is built in to Terraform
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v4.67.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
sudo docker compose run --rm devops-utils sh -c 'cd components/ansible; terraform plan -no-color -var-file="../../accounts/workloads/ansible/var.tfvars"'
data.terraform_remote_state.role: Reading...
data.terraform_remote_state.key_pair: Reading...
data.aws_subnet.selected: Reading...
data.aws_iam_role.ssm_role: Reading...
module.ansible.data.aws_ami.ubuntu: Reading...
data.aws_security_group.selected: Reading...
data.aws_key_pair.existing: Reading...
data.terraform_remote_state.key_pair: Read complete after 1s
data.terraform_remote_state.role: Read complete after 1s
module.ansible.aws_iam_instance_profile.test_profile: Refreshing state... [id=test-profile-1]
data.aws_iam_role.ssm_role: Read complete after 0s [id=ssm-arthur]
data.aws_key_pair.existing: Read complete after 1s [id=key-047de3aceffd4d5aa]
data.aws_subnet.selected: Read complete after 1s [id=subnet-0df397f1efbd4a408]
data.aws_security_group.selected: Read complete after 1s [id=sg-034b1ff403d4c412b]
module.ansible.aws_network_interface.this[0]: Refreshing state... [id=eni-07ca18b16d6de698a]
module.ansible.data.aws_ami.ubuntu: Read complete after 1s [id=ami-095e8c26af3940dc2]
module.ansible.aws_instance.this[0]: Refreshing state... [id=i-0e660e8981bf73046]
module.ansible.aws_eip.this[0]: Refreshing state... [id=eipalloc-0cbc6a57da8f0b010]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ansible.aws_iam_instance_profile.test_profile has been deleted
  - resource "aws_iam_instance_profile" "test_profile" {
        id          = "test-profile-1"
      - name        = "test-profile-1" -> null
        # (6 unchanged attributes hidden)
    }

  # module.ansible.aws_network_interface.this[0] has changed
  ~ resource "aws_network_interface" "this" {
        id                        = "eni-07ca18b16d6de698a"
        tags                      = {
            "Name"  = "runner_primary_network_interface-0"
            "Owner" = "arthur"
            "nuke"  = "skip"
        }
        # (22 unchanged attributes hidden)

      + attachment {
          + attachment_id = "eni-attach-074159c443b00ea1c"
          + device_index  = 0
          + instance      = "i-0e660e8981bf73046"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ansible.aws_iam_instance_profile.test_profile will be created
  + resource "aws_iam_instance_profile" "test_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "test-profile-1"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ssm-arthur"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.ansible.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ ami                                  = "ami-0312bcacbe51d03c8" -> "ami-095e8c26af3940dc2" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-southeast-2:722141136946:instance/i-0e660e8981bf73046" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "ap-southeast-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0e660e8981bf73046" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-07ca18b16d6de698a" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-10.ap-southeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.10" -> (known after apply)
      ~ public_dns                           = "ec2-54-253-67-254.ap-southeast-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.253.67.254" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      ~ subnet_id                            = "subnet-0df397f1efbd4a408" -> (known after apply)
        tags                                 = {
            "Name"  = "arthur-test-ansible"
            "Owner" = "arthur"
            "nuke"  = "skip"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-034b1ff403d4c412b",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 2 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 2 -> (known after apply)
          ~ http_tokens                 = "required" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = true -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:ap-southeast-2:722141136946:key/7b5b848c-16e0-45a6-8c89-7d6b9e5cefa7" -> (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0ed8449947e332157" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp3" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```